ConfigurationServiceDesk/src/Documents/ОбращениеПользователя/ОбращениеПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбращениеПользователя</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ПользователиИТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.СервисыИТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителей</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРеакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокРешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияВРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтекОшибок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сообщения</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ПользователиИТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationServiceDesk/src/Documents/ОбращениеПользователя/Forms/ФормаОбращенияПользователя/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // Проверяем, что это новый документ
    Если Объект.Ссылка.Пустая() Тогда
        ЗаполнитьПользователяПоНаименованию();
    КонецЕсли;
    
    // Проверяем, есть ли у текущего пользователя роль администратора
    ЭтоАдминистратор = РольДоступна("Администратор");
    
    // Управляем доступностью поля "Исполнитель"
    // "Исполнитель" — это имя элемента на форме (проверьте его в свойствах)
    Элементы.Исполнитель.ТолькоПросмотр = НЕ ЭтоАдминистратор;
    
    // Заполняем системную информацию, если это новый документ
    Если Объект.Ссылка.Пустая() Тогда
        
        // 1. Версия платформы
        СистемнаяИнфо = Новый СистемнаяИнформация;
        Объект.ВерсияПлатформы = СистемнаяИнфо.ВерсияПриложения; // Например, 8.3.27.1508
        
        // 2. Имя конфигурации
        Объект.Конфигурация = Метаданные.Имя; // ConfigurationServiceDesk
        
        // 3. Строка соединения (Имя базы)
        Объект.ИмяБазы = СтрокаСоединенияИнформационнойБазы();
        
    КонецЕсли;
    
    // 2. Управление доступом
    // Проверяем наличие прав администратора или исполнителя
    ДоступРазрешен = РольДоступна("Администратор") ИЛИ РольДоступна("Исполнитель");
    
    // Управляем группой, в которую вы объединили эти три поля
    // Если группы нет, можно управлять каждым полем отдельно: Элементы.Конфигурация.Видимость = ...
    
    Элементы.ГруппаТехническиеДанные.Видимость = ДоступРазрешен;
    Элементы.ГруппаТехническиеДанные.ТолькоПросмотр = Истина; // Запрет редактирования для всех

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПользователяПоНаименованию()
	
	// Получаем полное имя текущего сеанса (например, "Иванов Иван Петрович")
	ИмяТекущегоПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	// Если полное имя не задано, попробуем краткое имя (логин)
	Если ПустаяСтрока(ИмяТекущегоПользователя) Тогда
		ИмяТекущегоПользователя = ИмяПользователя();
	КонецЕсли;
	
	// Ищем в справочнике ПользователиИТ по Наименованию
	НайденныйПользователь = Справочники.ПользователиИТ.НайтиПоНаименованию(ИмяТекущегоПользователя);
	
	// Проверяем, что объект найден и он активен
	Если Не НайденныйПользователь.Пустая() Тогда
		
		// Если нужно проверять флаг "Активен" (как в вашем реквизите)
		Если НайденныйПользователь.Активен Тогда
			Объект.Пользователь = НайденныйПользователь;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
